brew "fzf"
brew "gh"
brew "jq"
brew "ripgrep"
brew "starship"
brew "tree"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
cask "copilot-cli"
cask "deepl"
cask "displaylink"
cask "font-hackgen-nerd"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "mactex-no-gui"
cask "microsoft-edge"
cask "onedrive"
cask "pdfsam-basic"
cask "visual-studio-code"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-preview-github-styles"
vscode "eamodio.gitlens"
vscode "james-yu.latex-workshop"
vscode "mhutchie.git-graph"
vscode "ms-ceintl.vscode-language-pack-ja"
