# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# OCaml package manager
brew "opam"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Cross-shell prompt for astronauts
brew "starship"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# OpenAI's Codex desktop app for managing coding agents
cask "codex-app"
# Brings the power of Copilot coding agent directly to your terminal
cask "copilot-cli"
# AI-powered translator
cask "deepl"
# Drivers for DisplayLink docks, adapters and monitors
cask "displaylink"
cask "font-hackgen-nerd"
cask "font-jetbrains-mono-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Full TeX Live distribution without GUI applications
cask "mactex-no-gui"
# Multi-platform web browser
cask "microsoft-edge"
# Spreadsheet software
cask "microsoft-excel"
# Email client
cask "microsoft-outlook"
# Presentation software
cask "microsoft-powerpoint"
# Cloud storage client
cask "onedrive"
# Extracts pages, splits, merges, mixes and rotates PDF files
cask "pdfsam-basic"
# Team communication and collaboration software
cask "slack"
# Open-source code editor
cask "visual-studio-code"
# Video communication and virtual meeting platform
cask "zoom"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-preview-github-styles"
vscode "eamodio.gitlens"
vscode "james-yu.latex-workshop"
vscode "mhutchie.git-graph"
vscode "ms-ceintl.vscode-language-pack-ja"
